AUTO_config_TK_pesok/src/DataProcessors/ВыборПосетителей/ВыборПосетителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыборПосетителей</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Дата регистрации</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоДРФО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКассир</name>
    <comment>Признак того, что сотрудник является кассиром</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинНаКассу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольНаКассу</name>
    <comment>Пароль на кассу, если установлен, то сотрудник является кассиром</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКодНаКассу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильКассира</name>
    <type>
      <types>CatalogRef.ПрофилиКассиров</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DataProcessors/ВыборПосетителей/Forms/Форма/Module.bsl
&НаСервере
Процедура ВыгрузитьВнешнихНаСервере()
	МассивПосетителей = Новый Массив;
	Для Каждого стрПосетитель Из Внешние Цикл
		Посетитель = Новый Структура();
		Посетитель.Вставить("Наименование",стрПосетитель.Посетитель.Наименование);
		Посетитель.Вставить("ДоступРазрешен",стрПосетитель.ДоступРазрешен);
		Посетитель.Вставить("КодПоДРФО","ext"+СокрЛП(стрПосетитель.Посетитель.Код));
		Посетитель.Вставить("Телефон",стрПосетитель.Посетитель.Телефон);
		Посетитель.Вставить("Организация",СокрЛП(стрПосетитель.Посетитель.Контрагент));
		Посетитель.Вставить("Должность",СокрЛП(стрПосетитель.Посетитель.Должность));
		Посетитель.Вставить("Фото",стрПосетитель.Посетитель.Фото);
		МассивПосетителей.Добавить(Посетитель);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, МассивПосетителей); 
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Определение = Новый WSОпределения("https://orders-1c.digma.ua/SS/ws1.1cws?WSDL",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
	WS = Новый WSПрокси(Определение,"http://www.StartStop.ua","CommunicationStartStop","CommunicationStartStopSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	
	ОтветРезультат = WS.RegisterVisitors(СтрокаJSON);
	
	ВсеОК = ОтветРезультат.StatusDownload;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОтветРезультат.Description);
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВнутреннихНаСервере(Проверка)
	Определение = Новый WSОпределения("https://orders-1c.digma.ua/zuUU/ws/cwd2.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
	WS = Новый WSПрокси(Определение,"http://www.digma.ua","CommunicationWithDatabases","CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
	WS.Пользователь="ObmenSSL";
	WS.Пароль ="bynthghbpf";
	
	МассивПосетителей = Новый Массив;
	
	Для Каждого стрПосетитель Из Внутренние Цикл
		Посетитель = Новый Структура();
		Посетитель.Вставить("Наименование",(стрПосетитель.Посетитель.Наименование));
		//Посетитель.Вставить("ДоступРазрешен",стрПосетитель.ДоступРазрешен);
		Посетитель.Вставить("КодПоДРФО",СокрЛП(стрПосетитель.Посетитель.Код));
		//Посетитель.Вставить("ТелефонТК",СокрЛП(стрПосетитель.Телефон));
		Посетитель.Вставить("ЭтоКуратор",стрПосетитель.ЭтоКуратор);
		МассивПосетителей.Добавить(Посетитель);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, МассивПосетителей); 
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Рез = WS.RegisterVisitors(СтрокаJSON, Проверка);
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Рез);
	ОтветРезультат = ПрочитатьJSON(Чтение);
	
	Внутренние.Очистить();
	Если Проверка Тогда
		ОтветМассивПосетителей = ОтветРезультат;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОтветРезультат.Результат.Description);
		ОтветМассивПосетителей = ОтветРезультат.МассивПосетителей;
	КонецЕсли;
	
	Для Каждого стрПосетитель Из ОтветМассивПосетителей Цикл
		стр = Внутренние.Добавить();
		ЗаполнитьЗначенияСвойств(стр,стрПосетитель);
		стр.Посетитель = Справочники.ФизическиеЛица.НайтиПоКоду(стрПосетитель.КодПоДРФО);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВнешние" Тогда
		Если Внешние.Количество() > 0 Тогда
			ВыгрузитьВнешнихНаСервере();
		КонецЕсли;
	КонецЕсли;
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаВнутренние" Тогда
		Если Внутренние.Количество() > 0 Тогда
			ВыгрузитьВнутреннихНаСервере(Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПолучитьКураторовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Значение КАК Посетитель,
	|	ИСТИНА КАК ЭтоКуратор
	|ИЗ
	|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
	|ГДЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Посетитель
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Внутренние.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьКураторов(Команда)
	ПолучитьКураторовНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьСотрудников(Команда)
	Если Внутренние.Количество() > 0 Тогда
		ВыгрузитьВнутреннихНаСервере(Истина);
	КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ВнешниеПосетительДоступРазрешен(Посетитель)
	ДоступРазрешен = Посетитель.ДоступРазрешен;
	Возврат ДоступРазрешен;
КонецФункции


&НаКлиенте
Процедура ВнешниеПосетительПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Внешние.ТекущиеДанные;
	ТекущиеДанные.ДоступРазрешен = ВнешниеПосетительДоступРазрешен(ТекущиеДанные.Посетитель);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЭтоКуратор(ФизЛицо)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Значение КАК Посетитель
	|ИЗ
	|	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
	|ГДЕ
	|	ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""КураторПлощадки""
	|	И ТорговыеПлощадкиДополнительныеРеквизиты.Значение = &ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Посетитель
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ФизЛицо",ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции


&НаКлиенте
Процедура ВнутренниеПосетительПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Внутренние.ТекущиеДанные;
	ФизЛицо = ТекущиеДанные.Посетитель;
	ТекущиеДанные.ЭтоКуратор = ЭтоКуратор(ФизЛицо);
КонецПроцедуры
